package main

import (
	"fmt"
	newsudoku "slice_live/newSudoku"
	"time"
)

func main() {
	start := time.Now().Nanosecond()
	tp := newsudoku.New()
	data := [9][9]uint8{
		// 最难
		{8, 0, 0, 0, 0, 0, 0, 0, 0},
		{0, 0, 3, 6, 0, 0, 0, 0, 0},
		{0, 7, 0, 0, 9, 0, 2, 0, 0},
		{0, 5, 0, 0, 0, 7, 0, 0, 0},
		{0, 0, 0, 0, 4, 5, 7, 0, 0},
		{0, 0, 0, 1, 0, 0, 0, 3, 0},
		{0, 0, 1, 0, 0, 0, 0, 6, 8},
		{0, 0, 8, 5, 0, 0, 0, 1, 0},
		{0, 9, 0, 0, 0, 0, 4, 0, 0},
		// 随便找的
		// {0,0,0,6,0,5,0,0,0},
		// {0,0,0,0,7,0,0,0,0},
		// {0,8,3,0,0,0,0,6,0},
		// {0,3,0,0,9,0,0,0,4},
		// {0,0,0,0,0,4,7,5,0},
		// {4,0,0,8,3,0,1,0,0},
		// {0,0,0,0,0,9,0,0,0},
		// {0,9,4,0,0,0,2,8,0},
		// {0,2,6,0,0,3,0,0,0},
	}
	tp.Init(data)
	time1 := 0
	for {
		if tp.Blank == 0 {
			break
		}
		tp.Next()
		time1++
	}

	tp.PrintTable()
	end := time.Now().Nanosecond()
	fmt.Println(end - start)
}
